app/Http/Controllers/Frontend/HomeController.php

select * from `kepala_sekolah` limit 1
select * from `guru` order by `created_at` desc limit 6
select * from `berita` where `status` = 'published' order by `tanggal_publikasi` desc limit 3
---
    public function index()
    {
        $kepalaSekolah = KepalaSekolah::first();
        $gurus = Guru::latest()->take(6)->get();
        $stats = Stats::getStats();

        // ✅ hanya ambil yang statusnya published
        $beritas = Berita::where('status', 'published')
            ->orderBy('tanggal_publikasi', 'desc')
            ->take(3)
            ->get();

select * from `berita` where `status` = 'published' order by `tanggal_publikasi` desc limit 9 offset 0
select count(*) as aggregate from `berita` where `status` = 'published'
---
    public function beritaIndex()
    {
        $beritas = Berita::where('status', 'published')
            ->orderBy('tanggal_publikasi', 'desc')
            ->paginate(9);

select * from `berita` where `slug` = 'beritaaaaa' and `status` = 'published' limit 1
---
    public function beritaShow($slug)
    {
        $berita = Berita::where('slug', $slug)
            ->where('status', 'published')
            ->firstOrFail();