app/Models/Stats.php

select * from `stats` limit 1
---
    public static function getStats()
    {
        return self::first() ?? self::create([
            'siswa_aktif' => 0,
            'tenaga_pengajar' => 0,
            'tahun_berdiri' => '2024',
            'akreditasi' => 'A'
        ]);