app/Http/Controllers/Admin/GuruController.php

    public function index()
    {
        $gurus = Guru::orderBy("created_at", "desc")->paginate(10);
---
select * from `guru` order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `guru`