app/Http/Controllers/Admin/KepalaSekolahController.php

select * from `kepala_sekolah` limit 1
---
    public function index()
    {
        $kepalaSekolah = KepalaSekolah::first();