app/Http/Controllers/Admin/ProgramController.php

select * from `programs` order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `programs`
---
    public function index()
    {
        $programs = Program::latest()->paginate(10);